authenticate-me/backend/app/models/user.rb

  def self.find_by_credentials(credential,password)
    if URI::MailTo::EMAIL_REGEXP.match?(credential)
      user = User.find_by(email:credential)
    else
      user = User.find_by(username:credential)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.update!({session_token: self.session_token})
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-03-28 03:01:01.550152"], ["id", 1]]

  def generate_unique_session_token
    token = SecureRandom::urlsafe_base64
        while User.exists?(session_token:token )
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]