bench_bnb/backend/app/controllers/api/benches_controller.rb

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"

    def create
        @bench = Bench.new(bench_params)
        if @bench.save!
---
INSERT INTO "benches" ("title", "description", "price", "seating", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", "hello"], ["description", "hi"], ["price", 20], ["seating", 5], ["lat", 10.0], ["lng", 20.0], ["created_at", "2023-03-30 20:27:48.006368"], ["updated_at", "2023-03-30 20:27:48.006368"]]

    def show
        @bench = Bench.find(params[:id])
---
SELECT "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]